🚀&nbsp; env0 had composed a PR Plan for environment [My First Project / staging ](https://app.env0.com/p/f249f379-6361-4103-834b-c4232af1a899/environments/3d16b022-4b5d-4a26-9807-0cb96bce3b60):
```
Plan: 1 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:


  # digitalocean_app.app will be created
+   resource "digitalocean_app" "app" {
+       active_deployment_id = (known after apply)
+       created_at           = (known after apply)
+       default_ingress      = (known after apply)
+       id                   = (known after apply)
+       live_url             = (known after apply)
+       updated_at           = (known after apply)
+       urn                  = (known after apply)

+       spec {
+           domains = (known after apply)
+           name    = "pdfsvc-app"
+           region  = "sfo"

+           database {
+               engine     = "PG"
+               name       = "db"
+               production = false
            }

+           domain {
+               name     = (known after apply)
+               type     = (known after apply)
+               wildcard = (known after apply)
+               zone     = (known after apply)
            }

+           env {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

+           service {
+               http_port          = 8000
+               instance_count     = 1
+               instance_size_slug = "basic-xs"
+               name               = "pdfsvc-api"
+               run_command        = "unitd --no-daemon --control unix:/var/run/control.unit.sock"

+               image {
+                   registry_type = "DOCR"
+                   repository    = "pdfsvc-registry"
+                   tag           = "latest"

+                   deploy_on_push {
+                       enabled = (known after apply)
                    }
                }

+               routes {
+                   path                 = (known after apply)
+                   preserve_path_prefix = (known after apply)
                }
            }

+           worker {
+               instance_count     = 1
+               instance_size_slug = "basic-xs"
+               name               = "celery-worker"
+               run_command        = "celery -A pdfsvc worker --concurrency=5"

+               image {
+                   registry_type = "DOCR"
+                   repository    = "pdfsvc-registry"
+                   tag           = "latest"

+                   deploy_on_push {
+                       enabled = (known after apply)
                    }
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
</details>


```
There are no cost estimation changes
```

[Full PR Plan logs on env0](https://app.env0.com/p/f249f379-6361-4103-834b-c4232af1a899/environments/3d16b022-4b5d-4a26-9807-0cb96bce3b60/deployments/234f4be8-214c-42cc-932e-55cf1702400b)